---
kind: other
id: Properties.T:Autodesk.Revit.DB.AlphanumericRevisionSettings
source: html/d5e3c4e5-cd50-22f8-b578-88e82535df94.htm
---
# AlphanumericRevisionSettings Properties

Specifies whether the .NET object represents a valid Revit entity.